In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
data_df=pd.read_excel('深圳市环境数据.xls',sheet_name='data')
name_df=pd.read_excel('深圳市环境数据.xls',sheet_name='name')

In [12]:
data_df

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,0.027,0.027,0.018,0.020,0.024,0.021,0.030,0.023,0.016,0.013,0.011,0.011,0.01,0.011,0.003285,0.002920,0.002920,0.00292
1,0.055,0.058,0.050,0.057,0.072,0.039,0.053,0.054,0.047,0.042,0.045,0.048,0.04,0.040,0.012775,0.012045,0.012045,0.01095
2,38427.000,39264.000,40780.000,40872.000,43633.000,43453.000,42380.000,37957.000,33850.000,31947.000,32642.000,9482,9847.00,8193.000,5326.000000,4167.000000,4762.000000,1339.00000
3,3352.000,3477.000,4287.000,5052.000,6241.000,6468.000,4028.650,3261.960,4044.690,3506.620,1670.230,1 254.50,827.76,753.150,728.880000,1138.340000,1720.630000,904.74000
4,43.080,43.800,42.240,58.630,83.370,85.390,107.350,161.820,141.580,139.450,146.440,132.59,121.53,123.840,141.420000,124.630000,142.130000,165.21000

In [13]:
name_df

                name
0  可吸入颗粒物年平均值(mg/m3)
1    二氧化硫年平均值(mg/m3)
2    二氧化氮年平均值(mg/m3)
3       工业二氧化硫排放量（吨）
4        工业烟粉尘排放量（吨）
5      工业固体废物产生量（万吨）